# Melting Data

In [39]:
df = pd.read_csv('tb.csv',usecols=[0,1,2,3,4,5])
df.head(5)

  iso2  year  new_sp  new_sp_m04  new_sp_m514  new_sp_m014
0   AD  1989     NaN         NaN          NaN          NaN
1   AD  1990     NaN         NaN          NaN          NaN
2   AD  1991     NaN         NaN          NaN          NaN
3   AD  1992     NaN         NaN          NaN          NaN
4   AD  1993    15.0         NaN          NaN          NaN

In [38]:
melted_df = pd.melt(df, id_vars=['iso2', 'year'], )
melted_df.head(5)

  iso2  year variable  value
0   AD  1989   new_sp    NaN
1   AD  1990   new_sp    NaN
2   AD  1991   new_sp    NaN
3   AD  1992   new_sp    NaN
4   AD  1993   new_sp   15.0